app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator = params[:user_id]
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "DogPics"], ["description", "asdfasdfasdf"], ["moderator_id", 4], ["created_at", "2021-04-12 21:32:25.134636"], ["updated_at", "2021-04-12 21:32:25.134636"]]